tap "aws/tap"
tap "homebrew/services"
tap "mongodb/brew"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript", link: false
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Platform built on V8 to build network applications
brew "node", link: false
# Create, run, and share large language models (LLMs)
brew "ollama"
# Zsh prompt for Astronauts
brew "spaceship"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Automatic workarounds for problems in Wine
brew "winetricks"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# App to build and share containerised applications and microservices
cask "docker"
cask "font-sf-mono-nerd-font-ligaturized"
# Text editor for code, markup and prose
cask "sublime-text"
vscode "ardenivanov.svelte-intellisense"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.live-server"
vscode "msjsdiag.vscode-react-native"
vscode "rust-lang.rust-analyzer"
vscode "shyykoserhiy.git-autoconfig"
vscode "svelte.svelte-vscode"
vscode "tobermory.es6-string-html"
vscode "wayou.vscode-todo-highlight"
vscode "zhuangtongfa.material-theme"
